---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeTreadriserType
source: html/4d6567c1-b283-caf0-c343-26d917b14a1d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsLandingtypeTreadriserType Property

"Type": Tread/Riser Type

## Syntax (C#)
```csharp
public static ForgeTypeId StairsLandingtypeTreadriserType { get; }
```